import { Translation } from '@jsverse/transloco';

export const ukAgreementTranslation: Translation = {
  'agreement.title': 'ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ КУПІВЛІ-ПРОДАЖУ ТОВАРІВ',
  'agreement.intro':
    'ПРИВАТНЕ ПІДПРИЄМСТВО «БРЕВІ» пропонує необмеженому та невизначеному колу Покупців укласти договір публічної оферти купівлі-продажу товарів, інформація про які розміщена на офіційному Інтернет-сайті-магазині Продавця, далі – «Товари», на таких умовах:',
  'agreement.section1.title': '1. Терміни і визначення',
  'agreement.section1.p1':
    '1.1. Публічна оферта – пропозиція Продавця адресована необмеженому та невизначеному колу Покупців незалежно від їх статусу (юридична особа, фізична особа-підприємець, фізична особа) укласти договір купівлі-продажу товарів.',
  'agreement.section1.p2':
    '1.2. Договір публічної оферти – публічний договір, зразок якого розміщений у вільному доступі на офіційному Інтернет-сайті-магазині Продавця, далі – «Договір».',
  'agreement.section1.p3':
    '1.3. Офіційний Інтернет-сайт-магазин Продавця – веб-сторінка за адресою у мережі Інтернет: brevi.com.ua, створена Продавцем для оптового та роздрібного продажу товарів дистанційним способом шляхом інформування Покупця про товари, у т.ч. про їх ціну, технічні характеристики, опис, способи замовлення, оплати і доставки, далі – «Сайт».',
  'agreement.section1.p4':
    '1.4. Товари – об’єкт угоди сторін, який був обраний Покупцем на Сайті через форму «Кошик» на Сайті, форму замовлення на Сайті або купується Покупцем у Продавця дистанційним способом.',
  'agreement.section1.p5': '1.5. Сторони – Покупець та Продавець.',
  'agreement.section1.p6':
    '1.6. Покупець – Сторона Договору, юридична особа чи фізична особа-підприємець, які зараєстровані у відповідності до законодавства України, або дієздатна фізична особа, яка досягла 18 років, що уклали з Продавцем Договір.',
  'agreement.section1.p7':
    '1.7. Продавець – Сторона Договору, ПРИВАТНЕ ПІДПРИЄМСТВО «БРЕВІ», код ЄДРПОУ 35521636, юридична особа, яка створена і діє відповідно до законодавства України, резидент України, платник податку на прибуток на загальних умовах та платник податку на додану вартість згідно Податкового Кодексу України, адреса місцезнаходження 36002, м. Полтава, вул. Кагамлика, буд. 3А, яке здійснює продаж Товарів.',
  'agreement.section1.p8': '1.8. Замовлення – вчинення Покупцем однієї з дій:',
  'agreement.section1.p8_1':
    '1.8.1. Обрання Покупцем окремих позицій із Товарів на Сайті і оформлення замовлення через форму «Кошик» на Сайті.',
  'agreement.section1.p8_2':
    '1.8.2. Заповнення Покупцем і відправлення Продавцю форми замовлення на Сайті.',
  'agreement.section1.p8_3':
    '1.8.3. Письмове оформлення Покупцем і передачу Продавцю замовлення іншими способами: електронною поштою, повідомленням у месенджерах Viber, WhatsApp, Telegram чи інших, письмово поштою чи особисто за адресою місцезнаходження Продавця або усно за телефоном зазначеним на сайті чи особисто за адресою місцезнаходження Продавця.',
  'agreement.section1.p9':
    '1.9. Акцепт – повна і безумовна згода Покупця з усіма умовами Договору шляхом вчинення ним однієї з дій:',
  'agreement.section1.p9_1':
    '1.9.1. Обрання Покупцем окремих позицій із розміщених Товарів на Сайті і оформлення замовлення через форму «Кошик» та оплата за обрані Товари за допомогою однієї з платіжних систем, розміщених на Сайті, зокрема шляхом прийому платежів через систему LiqPay.',
  'agreement.section1.p9_2':
    '1.9.2. Обрання Покупцем окремих позицій із розміщених Товарів на Сайті і заповнення Покупцем і відправлення Продавцю форми замовлення на Сайті та оплата за обрані Товари за допомогою однієї з платіжних систем, розміщених на Сайті, зокрема шляхом прийому платежів через систему LiqPay.',
  'agreement.section1.p9_3':
    '1.9.3. Обрання Покупцем окремих позицій із розміщених Товарів на Сайті, письмове оформлення Покупцем і передачу Продавцю замовлення електронною поштою, повідомленням у месенджерах Viber, WhatsApp, Telegram чи інших письмово поштою чи особисто і оплата за обрані Товари шляхом перерахування грошових коштів на розрахунковий рахунок Продавця через установи банків на підставі рахунку-фактури виставленного Продавцем Покупцю.',
  'agreement.section2.title': '2. Загальні положення',
  'agreement.section2.p1':
    '2.1. Договір укладається шляхом Акцепту, тобто надання повної і безумовної згоди Покупця на укладення Договору у повному обсязі без підписання письмового примірника Договору Сторонами.',
  'agreement.section2.p2':
    '2.2. Договір має юридичну силу відповідно до законодавства України і є рівносильним Договору, оформленому письмово і підписаному Сторонами.',
  'agreement.section2.p3':
    '2.3. Покупець підтверджує факт ознайомлення та згоди з усіма умовами Договору у повному обсязі шляхом Акцепту.',
  'agreement.section2.p4': '2.4. Будь-яка з наступних дій вважається Акцептом:',
  'agreement.section2.p4_1': '- реєстрація Покупця на Сайті;',
  'agreement.section2.p4_2': '- оформлення Покупцем замовлення через форму «Кошик» на Сайті;',
  'agreement.section2.p4_3': '- оформлення Покупцем замовлення через форму замовлення на Сайті;',
  'agreement.section2.p4_4':
    '- оплата Покупцем замовлення на Сайті через одну з платіжних систем, розміщених на Сайті, зокрема через систему LiqPay;',
  'agreement.section2.p4_5':
    '- оплата Покупцем замовлення на підставі рахунку-фактури, виставленого Продавцем.',
  'agreement.section2.p5':
    '2.5. Укладаючи Договір Покупець автоматично підтверджує факт ознайомлення та згоди з усіма умовами Договору у повному обсязі без будь-яких виключень та застережень.',
};

export const ruAgreementTranslation: Translation = {
  'agreement.title': 'ДОГОВОР ПУБЛИЧНОЙ ОФЕРТЫ КУПЛИ-ПРОДАЖИ ТОВАРОВ',
  'agreement.intro':
    'ЧАСТНОЕ ПРЕДПРИЯТИЕ «БРЕВИ» предлагает неограниченному и неопределенному кругу Покупателей заключить договор публичной оферты купли-продажи товаров, информация о которых размещена на официальном Интернет-сайте-магазине Продавца, далее – «Товары», на следующих условиях:',
  'agreement.section1.title': '1. Термины и определения',
  'agreement.section1.p1':
    '1.1. Публичная оферта – предложение Продавца, адресованное неограниченному и неопределенному кругу Покупателей независимо от их статуса (юридическое лицо, физическое лицо-предприниматель, физическое лицо) заключить договор купли-продажи товаров.',
  'agreement.section1.p2':
    '1.2. Договор публичной оферты – публичный договор, образец которого размещен в свободном доступе на официальном Интернет-сайте-магазине Продавца, далее – «Договор».',
  'agreement.section1.p3':
    '1.3. Официальный Интернет-сайт-магазин Продавца – веб-страница по адресу в сети Интернет: brevi.com.ua, созданная Продавцом для оптовой и розничной продажи товаров дистанционным способом путем информирования Покупателя о товарах, в т.ч. об их цене, технических характеристиках, описании, способах заказа, оплаты и доставки, далее – «Сайт».',
  'agreement.section1.p4':
    '1.4. Товары – объект соглашения сторон, который был выбран Покупателем на Сайте через форму «Корзина» на Сайте, форму заказа на Сайте или приобретается Покупателем у Продавца дистанционным способом.',
  'agreement.section1.p5': '1.5. Стороны – Покупатель и Продавец.',
  'agreement.section1.p6':
    '1.6. Покупатель – Сторона Договора, юридическое лицо или физическое лицо-предприниматель, зарегистрированные в соответствии с законодательством Украины, или дееспособное физическое лицо, достигшее 18 лет, заключившие с Продавцом Договор.',
  'agreement.section1.p7':
    '1.7. Продавец – Сторона Договора, ЧАСТНОЕ ПРЕДПРИЯТИЕ «БРЕВИ», код ЕГРПОУ 35521636, юридическое лицо, созданное и действующее в соответствии с законодательством Украины, резидент Украины, плательщик налога на прибыль на общих условиях и плательщик налога на добавленную стоимость согласно Налоговому Кодексу Украины, адрес местонахождения 36002, г. Полтава, ул. Кагамлыка, д. 3А, осуществляющее продажу Товаров.',
  'agreement.section1.p8': '1.8. Заказ – совершение Покупателем одного из действий:',
  'agreement.section1.p8_1':
    '1.8.1. Выбор Покупателем отдельных позиций из Товаров на Сайте и оформление заказа через форму «Корзина» на Сайте.',
  'agreement.section1.p8_2':
    '1.8.2. Заполнение Покупателем и отправка Продавцу формы заказа на Сайте.',
  'agreement.section1.p8_3':
    '1.8.3. Письменное оформление Покупателем и передача Продавцу заказа другими способами: электронной почтой, сообщением в мессенджерах Viber, WhatsApp, Telegram или других, письменно почтой или лично по адресу местонахождения Продавца или устно по телефону, указанному на сайте, или лично по адресу местонахождения Продавца.',
  'agreement.section1.p9':
    '1.9. Акцепт – полное и безусловное согласие Покупателя со всеми условиями Договора путем совершения им одного из действий:',
  'agreement.section1.p9_1':
    '1.9.1. Выбор Покупателем отдельных позиций из размещенных Товаров на Сайте и оформление заказа через форму «Корзина» и оплата выбранных Товаров с помощью одной из платежных систем, размещенных на Сайте, в частности путем приема платежей через систему LiqPay.',
  'agreement.section1.p9_2':
    '1.9.2. Выбор Покупателем отдельных позиций из размещенных Товаров на Сайте и заполнение Покупателем и отправка Продавцу формы заказа на Сайте и оплата выбранных Товаров с помощью одной из платежных систем, размещенных на Сайте, в частности путем приема платежей через систему LiqPay.',
  'agreement.section1.p9_3':
    '1.9.3. Выбор Покупателем отдельных позиций из размещенных Товаров на Сайте, письменное оформление Покупателем и передача Продавцу заказа электронной почтой, сообщением в мессенджерах Viber, WhatsApp, Telegram или других письменно почтой или лично и оплата выбранных Товаров путем перечисления денежных средств на расчетный счет Продавца через учреждения банков на основании счета-фактуры, выставленного Продавцом Покупателю.',
  'agreement.section2.title': '2. Общие положения',
  'agreement.section2.p1':
    '2.1. Договор заключается путем Акцепта, то есть предоставления полного и безусловного согласия Покупателя на заключение Договора в полном объеме без подписания письменного экземпляра Договора Сторонами.',
  'agreement.section2.p2':
    '2.2. Договор имеет юридическую силу в соответствии с законодательством Украины и является равносильным Договору, оформленному письменно и подписанному Сторонами.',
  'agreement.section2.p3':
    '2.3. Покупатель подтверждает факт ознакомления и согласия со всеми условиями Договора в полном объеме путем Акцепта.',
  'agreement.section2.p4': '2.4. Любое из следующих действий считается Акцептом:',
  'agreement.section2.p4_1': '- регистрация Покупателя на Сайте;',
  'agreement.section2.p4_2': '- оформление Покупателем заказа через форму «Корзина» на Сайте;',
  'agreement.section2.p4_3': '- оформление Покупателем заказа через форму заказа на Сайте;',
  'agreement.section2.p4_4':
    '- оплата Покупателем заказа на Сайте через одну из платежных систем, размещенных на Сайте, в частности через систему LiqPay;',
  'agreement.section2.p4_5':
    '- оплата Покупателем заказа на основании счета-фактуры, выставленного Продавцом.',
  'agreement.section2.p5':
    '2.5. Заключая Договор, Покупатель автоматически подтверждает факт ознакомления и согласия со всеми условиями Договора в полном объеме без каких-либо исключений и предостережений.',
};
